Masmiseim36/nxpSDK/devices/MKW38A4/drivers/fsl_flexcan.c
    if ((time_seg1 <= (MAX_EPSEG1 + MAX_EPROPSEG + 2U)) && (time_seg1 >= MIN_TIME_SEGMENT1))
    {
        if (time_seg1 > (MAX_EPROPSEG + 1U))
        {
            pTimingConfig->phaseSeg1 = time_seg1 - MAX_EPROPSEG - 2U;
            pTimingConfig->propSeg   = MAX_EPROPSEG;
        }
        else
        {
            pTimingConfig->phaseSeg1 = 0U;
            pTimingConfig->propSeg   = time_seg1 - 2U;
        }

        /* The value of prog Seg should be not larger than tqNum - 3U. */
        if (time_seg1 <= (tqNum - 3U))
        {
            pTimingConfig->phaseSeg2 = time_seg2 - 1U;

            if (pTimingConfig->phaseSeg2 <= MAX_EPSEG2)
            {
                if ((pTimingConfig->phaseSeg1 < pTimingConfig->phaseSeg2) &&
                    (pTimingConfig->propSeg > (pTimingConfig->phaseSeg2 - pTimingConfig->phaseSeg1)))
                {
                    pTimingConfig->propSeg -= (pTimingConfig->phaseSeg2 - pTimingConfig->phaseSeg1);
                    pTimingConfig->phaseSeg1 = pTimingConfig->phaseSeg2;
                }

                /* subtract one TQ for sync seg. */
                /* sjw is 20% of total TQ, rounded to nearest int. */
                pTimingConfig->rJumpwidth = ((uint8_t)tqNum + 4U) / 5U - 1U;
                /* The max tqNum for CBT will reach to 129, ERJW would not be larger than 26. */
                /* Considering that max ERJW is 31, rJumpwidth will always be smaller than MAX_ERJW. */
                if (pTimingConfig->rJumpwidth > MAX_ERJW)
                {
                    pTimingConfig->rJumpwidth = MAX_ERJW;
                }

                fgRet = true;
            }
        }
    }

    return fgRet;
}

/*!
 * @brief Calculates the segment values for a single bit time for CANFD bus data baud Rate
 *
 * @param baudRatebrs The canfd bus data speed in bps
 * @param tqNum Number of time quanta per bit
 * @param pTimingConfig Pointer to the FlexCAN timing configuration structure.
 *
 * @return TRUE if Calculates the segment success, FALSE if Calculates the segment success
 */
static bool FLEXCAN_FDGetSegmentswithBRS(uint32_t baudRatebrs, uint32_t tqNum, flexcan_timing_config_t *pTimingConfig)
{
    uint32_t ideal_sp;
    uint32_t time_seg1, time_seg2;
    bool fgRet = false;

    assert(tqNum <= FDCBT_MAX_TIME_QUANTA);

    /* get ideal sample point. */
    if (baudRatebrs >= 1000000U)
    {
        ideal_sp = IDEAL_SP_LOW;
    }
    else if (baudRatebrs >= 800000U)
    {
        ideal_sp = IDEAL_SP_MID;
    }
    else
    {
        ideal_sp = IDEAL_SP_HIGH;
    }

    /* distribute time quanta. */
    time_seg1 = (tqNum * ideal_sp) / (uint32_t)IDEAL_SP_FACTOR - 1U;
    if ((tqNum - time_seg1 - 1U) < MIN_TIME_SEGMENT2)
    {
        time_seg2 = MIN_TIME_SEGMENT2;
        time_seg1 = tqNum - time_seg2 - 1U;
    }
    else
    {
        time_seg2 = tqNum - time_seg1 - 1U;
    }

    if ((time_seg1 <= (MAX_FPSEG1 + MAX_FPROPSEG + 1U)) && (time_seg1 >= MIN_TIME_SEGMENT1))
    {
        if (time_seg1 > MAX_FPROPSEG)
        {
            pTimingConfig->fphaseSeg1 = time_seg1 - MAX_FPROPSEG - 1U;
            pTimingConfig->fpropSeg   = MAX_FPROPSEG;
        }
        else
        {
            pTimingConfig->fphaseSeg1 = 0U;
            pTimingConfig->fpropSeg   = time_seg1 - 1U;
        }

        /* The value of time_seg1 should be not larger than tqNum -3U. */
        if (time_seg1 <= (tqNum - 3U))
        {
            pTimingConfig->fphaseSeg2 = time_seg2 - 1U;

            if ((pTimingConfig->fphaseSeg1 < pTimingConfig->fphaseSeg2) &&
                (pTimingConfig->fpropSeg > (pTimingConfig->fphaseSeg2 - pTimingConfig->fphaseSeg1)))
            {
                pTimingConfig->fpropSeg -= (pTimingConfig->fphaseSeg2 - pTimingConfig->fphaseSeg1);
                pTimingConfig->fphaseSeg1 = pTimingConfig->fphaseSeg2;
            }

            /* subtract one TQ for sync seg. */
            /* sjw is 20% of total TQ, rounded to nearest int. */
            pTimingConfig->frJumpwidth = ((uint8_t)tqNum + 4U) / 5U - 1U;

            if (pTimingConfig->frJumpwidth > MAX_FRJW)
            {
                pTimingConfig->frJumpwidth = MAX_FRJW;
            }
            fgRet = true;
        }
    }

    return fgRet;
}

/*!
 * @brief Calculates the improved timing values by specific baudrates for CAN by CBT register
 *
 * @param baudRate  The classical CAN speed in bps defined by user
 * @param sourceClock_Hz The Source clock data speed in bps. Zero to disable baudrate switching
 * @param pTimingConfig Pointer to the FlexCAN timing configuration structure.
 *
 * @return TRUE if timing configuration found, FALSE if failed to find configuration
 */
static bool FLEXCAN_CalculateImprovedTimingValuesByCBT(uint32_t baudRate,
                                                       uint32_t sourceClock_Hz,
                                                       flexcan_timing_config_t *pTimingConfig)
{
    /* observe baud rate maximums. */
    assert(baudRate <= MAX_CAN_BAUDRATE);

    uint32_t clk;   /* the clock is tqNumb x baudRateFD. */
    uint32_t tqNum; /* Numbers of TQ. */
    bool fgRet = false;

    tqNum = CBT_MAX_TIME_QUANTA;
    /*  Auto Improved Protocal timing. */
    do
    {
        clk = baudRate * tqNum;
        if (clk > sourceClock_Hz)
        {
            continue; /* tqNum too large, clk has been exceed sourceClock_Hz. */
        }

        if ((sourceClock_Hz / clk * clk) != sourceClock_Hz)
        {
            continue; /* Non-supporting: the frequency of clock source is not divisible by target baud rate, the user
                      should change a divisible baud rate. */
        }

        /* Make sure the new calculated divider value is greater than the previous one. */
        if (pTimingConfig->preDivider > ((uint16_t)(sourceClock_Hz / clk) - 1U))
        {
            continue;
        }
        else
        {
            pTimingConfig->preDivider = (uint16_t)(sourceClock_Hz / clk) - 1U;
        }

        if (pTimingConfig->preDivider > MAX_EPRESDIV)
        {
            break; /* The frequency of source clock is too large or the baud rate is too small, the pre-divider could
                      not handle it. */
        }

        /* Try to get the best timing configuration. */
        if (FLEXCAN_FDGetSegments(baudRate, tqNum, pTimingConfig))
        {
            fgRet = true;
            break;
        }
    } while (--tqNum >= CBT_MIN_TIME_QUANTA);

